{
    "judultxtproposal1": "Latar Belakang Masalah",
    "isitxtproposal1": "Tantangan dalam manajemen parkir yang dihadapi saat ini adalah solusi tradisional yang terbukti tidak lagi memadai. Masalah seperti antrian panjang, konflik parkir, dan kesulitan dalam mengelola ruang parkir masih sering ditemui dalam pengelolaan parkir konvensional. Meningkatnya mobilitas masyarakat dan pertumbuhan jumlah kendaraan pribadi telah mendorong kebutuhan akan solusi yang lebih efisien dalam manajemen parkir. Oleh karena itu, perlu dicari solusi yang dapat mengatasi masalah ini dengan cara yang lebih modern dan efektif. Salah satu pendekatan yang relevan adalah dengan memanfaatkan teknologi QR Code dalam pengelolaan parkir. QR Code dapat digunakan untuk mengoptimalkan proses masuk dan keluar, serta pembayaran parkir. Dengan QR Code, pengguna dapat dengan mudah memindai kode saat memasuki area parkir dan melakukan pembayaran tanpa kontak, mengurangi waktu antrian dan meningkatkan keamanan. Selain itu, kebutuhan untuk pemantauan dan otomatisasi semakin meningkat dalam manajemen parkir modern. Data yang terkumpul dari penggunaan ruang parkir dapat digunakan untuk analisis yang lebih baik, membantu pemilik lokasi parkir dalam perencanaan dan pengelolaan yang lebih efisien. Dalam konteks ini, pengembangan sistem aplikasi parkir dengan QR Code menggunakan JavaScript ES6+ dan Go Fiber menjadi penting. Kombinasi teknologi modern ini dapat memberikan solusi yang relevan untuk mengatasi tantangan tradisional dalam manajemen parkir, meningkatkan mobilitas yang efisien, dan memenuhi kebutuhan akan pemantauan dan otomatisasi yang semakin penting dalam manajemen parkir saat ini. Dengan demikian, solusi ini memiliki potensi untuk meningkatkan pengalaman pengguna dan efisiensi dalam pengelolaan parkir di ULBI 'Pak Arbi' dan mungkin juga di lokasi parkir lainnya.",
    "judultxtproposal2": "Identifikasi Masalah",
    "isitxtproposal2": "1. Bagaimana masalah tradisional manajemen parkir teratasi?\n2. Bagaimana peningkatan mobilitas dan parkir yang efisien?\n3. Bagaimana kebutuhan untuk pemantauan dan otomatisasi? ",
    "judultxtproposal3": "Tujuan",
    "isitxtproposal3": "1. Mengetahui bagaimana masalah tradisional manajemen parkir teratasi.\n2. Mengetahui bagaimana peningkatan mobilitas dan parkir yang efisien.\n3. Mengetahui bagaimana kebutuhan untuk pemantauan dan otomatisasi."
}